rf-eng/micropython/ports/stm32/i2s.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 * Copyright (c) 2015 Bryan Morrissey
 * Copyright (c) 2020 Mike Teachman
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
#include <stdio.h>
#include <string.h>
#include <errno.h> // used by mp_is_nonblocking_error
#include "py/nlr.h"
#include "py/runtime.h"
#include "py/gc.h"

#if MICROPY_HW_ENABLE_I2S1 || MICROPY_HW_ENABLE_I2S2 || MICROPY_HW_ENABLE_I2S3

#include "py/objstr.h"
#include "py/objlist.h"
#include "py/stream.h"
#include "py/mphal.h"
#include "irq.h"
#include "pin.h"
#include "genhdr/pins.h"
#include "dma.h"
#include "bufhelper.h"
#include "i2s.h"
#include "led.h" // For debugging using led_toggle(n)

/// \moduleref pyb
/// \class I2S - Inter-IC-Sound, a protocol to transfer isochronous audio data
///
/// I2S is a serial protocol for sending and receiving audio. At the physical
/// level there are 3 or 4 lines: Bit Clock, Word Select, and 1 or 2 data lines
/// for simplex operation. In addition, I2S can optionally provide a
/// Master Clock (MCLK) signal to drive an external codec, or accept an I2S
/// clock input signal (I2S_CLKIN) from an external source to drive I2SPLL.
///

// Possible DMA configurations for I2S busses:

// TODO add F7 processor for SP1
// SPI2 RX:     DMA1_Stream3.CHANNEL_0
// SPI2 TX:     DMA1_Stream4.CHANNEL_0
// SPI3 RX:     DMA1_Stream0.CHANNEL_0 or DMA1_Stream2.CHANNEL_0
// SPI3 TX:     DMA1_Stream5.CHANNEL_0 or DMA1_Stream7.CHANNEL_0

#define AUDIOBUFFER_BYTES (1024 * 8)

typedef enum {
    INACTIVE       = 0x00,
    BUFFER_WR      = 0x01,
    BUFFER_RD      = 0x02,
    BUFFER_RD_WR   = 0x03,
    BUF_STR_DIV    = 0x04, // (xfer_state >= BUF_STR_DIV) indicates streaming
    STREAM_OUT     = 0x04,
    STREAM_IN      = 0x08,
} xfer_state_t;

// For buffer transfers, we want to be able to use the buffer methods write,
// read, and write_readinto as the transfer initiation function as well as the
// callback function.
// When a transfer is initiated, the state will be INACTIVE, so the full
// initialization occurs. After that, when the functions are incorporated into
// callbacks, the mode will be active, and the initialization can be skipped.
// The mode provides information as to the last function called, so if
// the callback is changed on the fly, (to go from a pure write to start
// recording as well) the functions can respond accordingly.

// Also, each function (read, write, write_readinto, and stream_out and stream_in)
// will check to make sure that any ongoing transfer is of the same type (buffer
// or stream) and will throw an exception without interrupting the ongoing transfer
// if called.

// If the stop() function is passed an argument, it can set flags to stop part of
// a transfer (read or write) while allowing the other part to continue uninterrupted

typedef enum {
    I2S_SIG_NONE,
    I2S_SIG_STOP_RX,
    I2S_SIG_STOP_TX,
    I2S_SIG_STOP_ALL,
    I2S_SIG_STOP_EOF_DIV,
    I2S_SIG_EOF_RX,
    I2S_SIG_EOF_TX,
    I2S_SIG_EOF_ALL,
} xfer_signal_t;

typedef struct _pyb_i2s_obj_t {
    mp_obj_base_t base;
    I2S_HandleTypeDef i2s;
    const dma_descr_t *tx_dma_descr;
    const dma_descr_t *rx_dma_descr; 
    uint32_t tx_dma_channel;
    uint32_t rx_dma_channel;
    DMA_HandleTypeDef tx_dma;
    DMA_HandleTypeDef rx_dma;
    mp_obj_base_t *dstream_tx;
    mp_obj_base_t *dstream_rx;
    mp_int_t stream_tx_len;
    mp_int_t stream_rx_len;
    mp_uint_t last_stream_read_sz;
    mp_uint_t last_stream_write_sz;
    mp_obj_t callback;
    xfer_state_t xfer_state;
    xfer_signal_t xfer_signal;
    const pin_obj_t *pins[5];
    // audio buffers placed before smaller struct members to keep word-alignment:
    uint16_t audiobuf_tx[2][AUDIOBUFFER_BYTES / 8];
    uint16_t audiobuf_rx[2][AUDIOBUFFER_BYTES / 8];
    mp_int_t i2s_id : 8;
    bool is_enabled : 1;
    bool base_is_tx : 1; // base instance SPIx is either tx or rx
    bool pp_ptr : 1;     // ping-pong pointer for double buffers
} pyb_i2s_obj_t;

// pins are Bit Clock, Word Select, TX Data, RX Data, and Master Clock Out
typedef enum { BCK, WS, TX, RX, MCK, NUM_PINS } i2s_pin_t;

// Note: This is where spi.c defines SPI_HandleTypeDef SPIHandle[1,2,3]
// as well as initializing the static pyb_spi_obj[] array -
// probably not needed here?

static inline bool i2s_has_tx(pyb_i2s_obj_t *i2s_obj) {
    return (i2s_obj->base_is_tx);
}

static inline bool i2s_has_rx(pyb_i2s_obj_t *i2s_obj) {
    return (!(i2s_obj->base_is_tx));
}

static inline bool i2s_is_master(pyb_i2s_obj_t *i2s_obj) {
    return (i2s_obj->i2s.Init.Mode == I2S_MODE_MASTER_TX ||
            i2s_obj->i2s.Init.Mode == I2S_MODE_MASTER_RX);
}

#if 0
static void led_flash_error(int colour, int count) {
    for(;;) {
        for (int c=0;c<count;c++) {
            led_state(colour, 1);
            HAL_Delay(300);
            led_state(colour, 0);
            HAL_Delay(300);
        }
        HAL_Delay(2000);
    }
}

static void led_flash_info(int colour, int count) {
    for (int c=0;c<count;c++) {
        led_state(colour, 1);
        HAL_Delay(300);
        led_state(colour, 0);
        HAL_Delay(300);
    }
}
#endif

// i2s_init0 is direct crib from stmhal/can.c - can_init0()
void i2s_init0(void) {
    for (int i = 0; i < MP_ARRAY_SIZE(MP_STATE_PORT(pyb_i2s_obj_all)); i++) {
        MP_STATE_PORT(pyb_i2s_obj_all)[i] = NULL;
    }
}

// assumes init parameters are set up correctly
STATIC bool i2s_init(pyb_i2s_obj_t *i2s_obj) {
    // init the GPIO lines
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
    GPIO_InitStructure.Pull = GPIO_PULLUP; // see spi.c for dealing with CPOL

