rf-eng/micropython/ports/stm32/i2s.c
    // TODO:
    // - Use STM32F4DISC to make sure that I2S3 works with that board's codec -
    // (I2S3 conflicts with SDIO and LED's on pyboard and therefore is disabled)
    // - Provide configuration to enable I2S_CKIN if it available (only if SDIO
    // is not configured)

    if (0) {
#if MICROPY_HW_ENABLE_I2S2
    } else if (i2s_obj->i2s_id == 2) {
        i2s_obj->i2s.Instance = SPI2;
        __SPI2_CLK_ENABLE();
        // configure DMA streams - see RM0090 section 10.3.3, Tables 42 & 43
        // simplex: set up both DMA streams for SPI2, only one will be used
        // TODO what to do when application tries to configure both I2S and SPI features on SPI2?
        i2s_obj->tx_dma_descr = &dma_I2S_2_TX;
        i2s_obj->rx_dma_descr = &dma_I2S_2_RX;
#endif
#if MICROPY_HW_ENABLE_I2S3
    } else if (i2s_obj->i2s_id == 3) {
        i2s_obj->i2s.Instance = SPI3;
        __SPI3_CLK_ENABLE();
        // configure DMA streams - see RM0090 section 10.3.3, Tables 42 & 43
        // I2S3 has alternate stream configurations, listed here in comments
        // set up both DMA streams for SPI3, only one will be used
        i2s_obj->tx_dma_stream = DMA1_Stream5;
        //i2s_obj->tx_dma_stream = DMA1_Stream7;
        i2s_obj->tx_dma_channel = DMA_CHANNEL_0;
        i2s_obj->rx_dma_stream = DMA1_Stream0;
        //i2s_obj->rx_dma_stream = DMA1_Stream2;
        i2s_obj->rx_dma_channel = DMA_CHANNEL_0;
#endif
    } else {
        // invalid i2s_id number; shouldn't get here as i2s object should not
        // have been created without setting a valid i2s instance number
        return false;
    }

    // GPIO Pin initialization
    // If master clock is not enabled, its pin will not get initialized
    int num_pins = (i2s_obj->i2s.Init.MCLKOutput ==
                    I2S_MCLKOUTPUT_ENABLE) ? NUM_PINS : NUM_PINS - 1;

    for (int i = 0; i < num_pins; i++) {
        if (i2s_obj->pins[i] != MP_OBJ_NULL) {
            GPIO_InitStructure.Pin = i2s_obj->pins[i]->pin_mask;
            const pin_af_obj_t *af = pin_find_af(i2s_obj->pins[i], AF_FN_I2S, i2s_obj->i2s_id);
            assert(af != NULL);
            // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
            GPIO_InitStructure.Alternate = (uint8_t)af->idx;
            HAL_GPIO_Init(i2s_obj->pins[i]->gpio, &GPIO_InitStructure);
        }
    }

    // Configure and enable I2SPLL - I2S_MASTER modes only:
    // ====================================================
    // References for STM32F405 (pybv10 and pybv11):
    //    1) table 127 "Audio frequency precision" of RM0090 Reference manual
    //    2) lines 457-494 of STM32Cube_FW_F4_V1.5.0/Drivers/BSP/STM32F4-Discovery/stm32f4_discovery_audio.c
    //
    // References for STM32F722 (PYBD-SF2W) and STM32F723 (PYBD-SF3W)
    //    1) table 204 "Audio-frequency precision" of RM0385 Reference manual
    //
    // References for STM32F767 (PYBD-SF6W)
    //    1) table 229 "Audio-frequency precision" of RM0410 Reference manual


    //    48kHz family is accurate for 8, 16, 24, and 48kHz but not 32 or 96
    //    44.1kHz family is accurate for 11.025, 22.05 and 44.1kHz but not 88.2

    // TODO: support more of the commonly-used frequencies and account for 16/32 bit frames
    // Also: Refactor to use macros as provided by stm32f4xx_hal_rcc_ex.h
#if defined (STM32F405xx)
    // __HAL_RCC_PLLI2S_CONFIG(__PLLI2SN__, __PLLI2SR__)
    __HAL_RCC_PLLI2S_DISABLE();
    if (i2s_is_master(i2s_obj)) {
        if (i2s_obj->i2s.Init.MCLKOutput == I2S_MCLKOUTPUT_ENABLE) {
            if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
                __HAL_RCC_PLLI2S_CONFIG(258, 3); // 8, 16, 24, 48kHz with mclkout; not 32 or 96
            } else {
                __HAL_RCC_PLLI2S_CONFIG(271, 2); // 11.025, 22.05, 44.1kHz with mclkout; not 88.2
            }
        } else {
            if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
                __HAL_RCC_PLLI2S_CONFIG(384, 5); // TODO
            } else {
                __HAL_RCC_PLLI2S_CONFIG(429, 4); // TODO
            }
        }
        __HAL_RCC_PLLI2S_ENABLE();
    }
#elif defined (STM32F722xx) || defined (STM32F723xx)
    // __HAL_RCC_PLLI2S_CONFIG(__PLLI2SN__, __PLLI2SQ__, __PLLI2SR__)
    __HAL_RCC_PLLI2S_DISABLE();
    if (i2s_is_master(i2s_obj)) {
        if (i2s_obj->i2s.Init.MCLKOutput == I2S_MCLKOUTPUT_ENABLE) {
            if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
                __HAL_RCC_PLLI2S_CONFIG(258, 1, 3); // TODO
            } else {
                __HAL_RCC_PLLI2S_CONFIG(271, 1, 2); // TODO
            }
        } else {
            if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
                __HAL_RCC_PLLI2S_CONFIG(384, 1, 5); // TODO
            } else {
                __HAL_RCC_PLLI2S_CONFIG(429, 1, 4); // TODO
            }
        }
        __HAL_RCC_PLLI2S_ENABLE();
    }
#elif defined (STM32F767xx)
#error I2S not supported on the STM32F767xx processor (coming soon ...)
#else
#error I2S does not support this processor
#endif // STM32F405xx

    if (HAL_I2S_Init(&i2s_obj->i2s) == HAL_OK) {
        // Reset and initialize Tx and Rx DMA channels
        // TODO: Currently both DMA's are initialized regardless of whether I2S
        // is instantiated - optimize this

        // Reset and initialize tx DMA
        dma_invalidate_channel(i2s_obj->tx_dma_descr);

        dma_init(&i2s_obj->tx_dma, i2s_obj->tx_dma_descr, DMA_MEMORY_TO_PERIPH, &i2s_obj->i2s);
        i2s_obj->i2s.hdmatx = &i2s_obj->tx_dma;

        // Workaround fix for streaming methods...
        // For streaming methods with a file based stream, I2S DMA IRQ priority must be lower than the SDIO DMA IRQ priority.
        // Explanation:
        //      i2s_stream_handler() is called in the I2S DMA IRQ handler context.  SD Card reads (SDIO peripheral) are called
        //      in i2s_stream_handler() using DMA.  When a block of SD card data is finished being read the
        //      SDIO DMA IRQ handler is never run because the I2S DMA IRQ handler is currently running and both IRQ have the
        //      same NVIC priority - as setup in dma_init().  The end result is that i2s_stream_handler() gets "stuck" in endless
        //      loop, in sdcard_wait_finished().  This happens on the 2nd call to i2s_stream_handler().
        // The following two lines are a workaround to correct this problem.  When the priority of SDIO DMA IRQ is greater than
        // I2S DMA IRQ the SDIO DMA IRQ handler will interrupt the I2S DMA IRQ handler, allowing sdcard_wait_finished()
        // to complete.
        // TODO figure out a more elegant way to solve this problem.
        // Investigate:  use the 1/2 complete DMA callback to execute stream read()

