rf-eng/micropython/ports/stm32/i2s.c
        // set I2S Tx DMA interrupt priority
        NVIC_SetPriority(DMA1_Stream4_IRQn, (IRQ_PRI_DMA+1));
        HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);

        // Reset and initialize rx DMA
        dma_invalidate_channel(i2s_obj->rx_dma_descr);

        dma_init(&i2s_obj->rx_dma, i2s_obj->rx_dma_descr, DMA_PERIPH_TO_MEMORY, &i2s_obj->i2s);
        i2s_obj->i2s.hdmarx = &i2s_obj->rx_dma;

        // set I2S Rx DMA interrupt priority
        NVIC_SetPriority(DMA1_Stream3_IRQn, (IRQ_PRI_DMA+1));
        HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

        i2s_obj->xfer_state = INACTIVE;
        i2s_obj->is_enabled = true;
    } else {
        i2s_obj->is_enabled = false;
    }
    return i2s_obj->is_enabled;
}

STATIC mp_obj_t pyb_i2s_deinit(mp_obj_t self_in);
void i2s_deinit(void) {
    for (int i = 0; i < MP_ARRAY_SIZE(MP_STATE_PORT(pyb_i2s_obj_all)); i++) {
        pyb_i2s_obj_t *i2s_obj = MP_STATE_PORT(pyb_i2s_obj_all)[i];
        if (i2s_obj != NULL) {
            pyb_i2s_deinit(i2s_obj);
        }
    }
}

// TODO: This is currently enabled to support the buffer-oriented methods send,
// recv, and send_recv. Eventually I2S should be entirely  non-blocking, using
// DMA with callbacks
STATIC HAL_StatusTypeDef i2s_wait_dma_finished(I2S_HandleTypeDef *i2s, uint32_t timeout) {
    uint32_t start = HAL_GetTick();
    while (HAL_I2S_GetState(i2s) != HAL_I2S_STATE_READY) {
        if (HAL_GetTick() - start >= timeout) {
            return HAL_TIMEOUT;
        }
        __WFI();
    }
    return HAL_OK;
}

STATIC HAL_StatusTypeDef i2s_bus_sync(pyb_i2s_obj_t *self, uint32_t polarity, uint32_t timeout) {
    // In I2S Slave mode, force a busy-wait for at least one full word-select
    // cycle to sync with WS clock before initiating a transfer.
    bool pol = polarity & 1;
    uint32_t start = HAL_GetTick();
    if (!i2s_is_master(self)) {
        while(HAL_GPIO_ReadPin(self->pins[WS]->gpio, self->pins[WS]->pin) == pol) {
            if (HAL_GetTick() - start >= timeout) { return HAL_TIMEOUT; }
        }
        while(HAL_GPIO_ReadPin(self->pins[WS]->gpio, self->pins[WS]->pin) == pol) {
            if (HAL_GetTick() - start >= timeout) { return HAL_TIMEOUT; }
        }
        while(HAL_GPIO_ReadPin(self->pins[WS]->gpio, self->pins[WS]->pin) == pol) {
            if (HAL_GetTick() - start >= timeout) { return HAL_TIMEOUT; }
        }
    }
    return HAL_OK;
}

STATIC void i2s_stream_handler(pyb_i2s_obj_t *self);
STATIC mp_obj_t pyb_i2s_callback(mp_obj_t self_in, mp_obj_t callback);

STATIC void i2s_handle_mp_callback(pyb_i2s_obj_t *self) {
    if (self->callback != mp_const_none) {
        gc_lock();
        nlr_buf_t nlr;
        if (nlr_push(&nlr) == 0) {
            mp_call_function_1(self->callback, self);
            nlr_pop();
        } else {
            // Uncaught exception; disable the callback so it doesn't run again.
            self->callback = mp_const_none;
            // DMA_HandleTypeDef dma = self->tx_dma;
            // __HAL_DMA_DISABLE(&dma);
            printf("uncaught exception in I2S(%u) DMA interrupt handler\n", self->i2s_id);
            mp_obj_print_exception(&mp_plat_print, (mp_obj_t)nlr.ret_val);
        }
        gc_unlock();
    }
}

void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s) {
    // I2S root pointer index is 1 if both I2S instances are enabled and I2S
    // instance is SPI3/I2S3; otherwise index is 0
    pyb_i2s_obj_t *self;
    if (0) {
#if MICROPY_HW_ENABLE_I2S2 && MICROPY_HW_ENABLE_I2S3
    } else if (hi2s->Instance == SPI3) {
        self = MP_STATE_PORT(pyb_i2s_obj_all)[1];
#endif
    } else {
        self = MP_STATE_PORT(pyb_i2s_obj_all)[0];
    }

    // The HAL_I2S_TxCpltCallback and RxCpltCallback should only get called after
    // a transfer is completed and the I2S bus is in the HAL_I2S_STATE_READY state.
    // However, the first time that HAL_I2S_TransmitReceiveDMA() gets called after
    // initializing the I2S bus, the callback gets triggered even though the I2S
    // bus is not in a ready state. This will cause a hard crash the next time
    // HAL_I2S_TransmitReceiveDMA() gets called.
    // Checking the state and calling HAL_I2S_DMAStop() before calling the
    // function again seems to resolve the problem; it also seems a bit hacky -
    // would be nice to figure out why this happens and how to prevent it.
    if (HAL_I2S_GetState(&self->i2s) != HAL_I2S_STATE_READY) {
        HAL_I2S_DMAStop(&self->i2s);
        // printf("I2S transfer stop and restart\n"); // DEBUG
    }

    if (self->xfer_state >= BUF_STR_DIV) {
        i2s_stream_handler(self);
    } else if (self->xfer_state != INACTIVE) {
        // buffer transfer, call user-defined callback
        i2s_handle_mp_callback(self);
    }
}

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s) {
    // I2S root pointer index is 1 if both I2S instances are enabled and I2S
    // instance is SPI3/I2S3; otherwise index is 0

    pyb_i2s_obj_t *self;
    if (0) {
#if MICROPY_HW_ENABLE_I2S2 && MICROPY_HW_ENABLE_I2S3
    } else if (hi2s->Instance == SPI3) {
        self = MP_STATE_PORT(pyb_i2s_obj_all)[1];
#endif
    } else {
        self = MP_STATE_PORT(pyb_i2s_obj_all)[0];
    }
    
    if (self->xfer_state >= BUF_STR_DIV) {
        i2s_stream_handler(self);
    } else if (self->xfer_state != INACTIVE) {
        // buffer transfer, call user-defined callback
        i2s_handle_mp_callback(self);
    }
}    
    
void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s) {
    uint32_t errorCode = HAL_I2S_GetError(hi2s);
    printf("I2S Error = %ld\n", errorCode);
}

// I2S HalfCplt callback stubs, currently unused
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {}
void HAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {}

/******************************************************************************/
/* Micro Python bindings                                                      */

// spi.c provides *spi_get_handle, do we need to provide *i2s_get_handle ?

STATIC void pyb_i2s_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    pyb_i2s_obj_t *self = self_in;

    mp_printf(print, "I2S(%u, pins=[", self->i2s_id);
    for (int i = 0; i < 4; i++) {
        if (self->pins[i] != MP_OBJ_NULL) {
            mp_printf(print, "%q ", self->pins[i]->name);
        } else {
            mp_print_str(print, "None ");
        }
    }
    mp_print_str(print, "\b]");
    if (self->is_enabled) {
        mp_print_str(print, ", I2S.");
        if (i2s_is_master(self)) {
            mp_printf(print, "%q, %q ", MP_QSTR_MASTER, MP_QSTR_mclkout);
            if (self->i2s.Init.MCLKOutput == I2S_MCLKOUTPUT_ENABLE) {
                mp_printf(print, "on %q", self->pins[MCK]->name);
            } else {
                mp_print_str(print, "off");
            }
            mp_printf(print, ", %q=%u", MP_QSTR_audiofreq, self->i2s.Init.AudioFreq);
        } else {
            mp_printf(print, "%q", MP_QSTR_SLAVE);
        }

        qstr standard = 0;
        if (self->i2s.Init.Standard == I2S_STANDARD_PHILIPS) { standard = MP_QSTR_PHILIPS; }
        else if (self->i2s.Init.Standard == I2S_STANDARD_MSB) { standard = MP_QSTR_MSB; }
        else if (self->i2s.Init.Standard == I2S_STANDARD_LSB) { standard = MP_QSTR_LSB; }
        else if (self->i2s.Init.Standard == I2S_STANDARD_PCM_SHORT) { standard = MP_QSTR_PCM_SHORT; }
        else if (self->i2s.Init.Standard == I2S_STANDARD_PCM_LONG) { standard = MP_QSTR_PCM_LONG; }
        else { /* shouldn't get here */ }
        mp_printf(print, ", %q=%u, %q=%q, ",
                  MP_QSTR_polarity, self->i2s.Init.CPOL, MP_QSTR_standard, standard);
        int n_data_bits = ((self->i2s.Init.DataFormat >> 1) + 2) * 8;
        mp_printf(print, "%q=%uB%s", MP_QSTR_dataformat, n_data_bits,
                  self->i2s.Init.DataFormat == I2S_DATAFORMAT_16B_EXTENDED ? "_EXT" : "");
    }
    mp_print_str(print, ")");
}

/// \method init(mode, dataformat=0, standard=I2S.PHILIPS,
///              polarity=0, audiofreq=48000, clksrc=I2S.PLL,
///              mclkout=0, callback=none)
///
/// Initialise the I2S bus with the given parameters:
///
///   - `mode` must be either `I2S.MASTER` or `I2S.SLAVE`.
///   - `standard` can be `PHILIPS`, `MSB`, `LSB`, `PCM_SHORT`, or `PCM_LONG`.
///   - `dataformat` can be 0 (16B_EXTENDED), 16, 24, or 32 (bits).
///   - `polarity` can be 0 for clock steady state low, or 1 for steady state high.
///   - Options only relevant to master mode:
///   - `audiofreq` can be any common audio sampling frequency, default is 48000.
///   - `clksrc` can be `PLL` or `EXTERNAL`.
///   - `mclkout` can be 0 to disable or 1 to enable.
STATIC mp_obj_t pyb_i2s_init_helper(pyb_i2s_obj_t *self, mp_uint_t n_args,
                                    const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,      MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0 /* MASTER */ } },
        { MP_QSTR_dataformat, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0 /* 16B EXTENDED */ } },
        { MP_QSTR_standard,   MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = I2S_STANDARD_PHILIPS} },
        { MP_QSTR_polarity,   MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_audiofreq,  MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = I2S_AUDIOFREQ_48K} },
        { MP_QSTR_clksrc,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = I2S_CLOCK_PLL} },
        { MP_QSTR_mclkout,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_callback,   MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
        // TODO: Include option for setting I2SPLL parameters directly?
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
                     MP_ARRAY_SIZE(allowed_args), allowed_args, args);

