rf-eng/micropython/ports/stm32/i2s.c
    // set the I2S configuration values
    memset(&self->i2s, 0, sizeof(self->i2s));
    I2S_InitTypeDef *init = &self->i2s.Init;

    // init->Mode can be MASTER_TX, MASTER_RX, SLAVE_TX, or SLAVE_RX;
    if (args[0].u_int == 0) {
        init->Mode = self->base_is_tx ? I2S_MODE_MASTER_TX : I2S_MODE_MASTER_RX;
    } else {
        init->Mode = self->base_is_tx ? I2S_MODE_SLAVE_TX : I2S_MODE_SLAVE_RX;
    }

    if (args[1].u_int == 0)  { init->DataFormat = I2S_DATAFORMAT_16B_EXTENDED; }
    else if (args[1].u_int == 16) { init->DataFormat = I2S_DATAFORMAT_16B; }
    else if (args[1].u_int == 24) { init->DataFormat = I2S_DATAFORMAT_24B; }
    else if (args[1].u_int == 32) { init->DataFormat = I2S_DATAFORMAT_32B; }
    else { mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("%d not a valid data format"), args[2].u_int); }
    init->Standard   = args[2].u_int;
    init->CPOL       = args[3].u_int ? I2S_CPOL_HIGH : I2S_CPOL_LOW;
    init->AudioFreq  = args[4].u_int;
    init->MCLKOutput = args[6].u_int ? I2S_MCLKOUTPUT_ENABLE : I2S_MCLKOUTPUT_DISABLE;
    // If an I2S object had previously registered callback, the default is to
    // keep that callback. TODO Is this correct, or should the default be to set the
    // callback to None on init?
    if (args[7].u_obj != mp_const_none) {
        pyb_i2s_callback(self, args[7].u_obj);
    }

    // -------------Possible bug in HAL-------------------
    // According to the datasheet (RM0090, Sec 28.4.6 - I2S Slave Mode) in Slave
    // mode there is no need to enable I2SPLL to generate a clock for the I2S
    // interface; the CLK and WS pins receive clock signals from another master
    // to drive the data transfer.
    // HOWEVER, HAL_I2S_Init returns an error if the I2SPLL is not enabled and
    // ClockSource != I2S_CLOCK_EXTERNAL
    // This appears to be incorrect behavior; the parameter I2S_CLOCK_EXTERNAL
    // is intended to set pin PC9 as I2S_CKIN, an external source for I2SPLL.
    // So I don't think that this work around is really correct here:
    if (args[0].u_int) {
        // Slave mode
        init->ClockSource = I2S_CLOCK_EXTERNAL;
    } else {
        init->ClockSource = args[5].u_int;
    }

    // init the I2S bus
    if (!i2s_init(self)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S port %d init failed"), self->i2s_id);
    }

    return mp_const_none;
}

/// \classmethod \constructor(bus, ...)
///
/// Construct an I2S object with the given list of pins.
/// I2S requires a clock pin (CK), a word select pin (WS) and
/// one data pin.
/// The pins can be passed as either a list or a tuple with the format
/// [Clock, Word Select, TX Data, RX Data]
/// The I2S port will be initialized in simplex mode, with the direction determined
/// by the position of the data pin in the list.
/// Examples:
/// pin_list = ['B10','B12',0,'C2'] - Simplex mode, C2 as RX
/// pin_list = ['Y6','Y5','Y7',0] - Simplex mode, Y7 as TX
/// Mixed list of strings and objects:
/// pin_list = [pyb.Pin.cpu.B10,'B12',0,'pyb.Pin.board.Y8']
///
/// Valid pins for I2S1 on the pyboard D:
/// TODO add Valid pins 
///
/// Valid pins for I2S2 on the pyboard v10/v11:
/// CK -    PB13 / Y6,  PB10 / Y9     (SPI2 SCK)
/// WS -    PB12 / Y5,  PB9  / Y4     (SPI2 NSS)
/// SD -    PB15 / Y8,  PC3  / X22    (SPI2 MOSI)
/// MCK -   PC6 / Y1
///
/// The I2S3 port is disabled by default on the pyboard, as its pins would
/// conflict with the SD Card and other pyboard functions. It can be enabled
/// for the STM32F4DISCOVERY port, which has an I2S codec on I2S3.
///
/// CK -    PC10 / NA (SD_D2),  PB3  / X17 (USR SW)       (SPI3 SCK)
/// WS -    PA4  / X5,          PA15 / P3  (YELLOW LED)   (SPI3 NSS)
/// SD -    PC12 / NA (SD_CK),  PB5  / NA  (MMA_AVDD)     (SPI3 MOSI)
/// MCK -   PC7 (Y2)
///
/// With no additional parameters, the I2S object is created but not
/// initialised (it has the settings from the last initialisation of
/// the bus, if any).  If extra arguments are given, the bus is initialised.
/// See `init` for parameters of initialisation.
STATIC mp_obj_t pyb_i2s_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // If n_args == 0 and I2S2 is enabled, set default pin list to the SPI2
    // pins on the pyboard (Y6, Y5, Y7, Y8):
#ifdef MICROPY_HW_ENABLE_I2S2
    mp_arg_check_num(n_args, n_kw, 0, MP_OBJ_FUN_ARGS_MAX, true);
#else
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
#endif

    // get array of pin identifiers, could be name strings or pin objects
    mp_uint_t array_len = 0;
    mp_obj_t *pin_names;
    if (n_args == 0) {
#ifdef MICROPY_HW_ENABLE_I2S2
        static const pin_obj_t *default_pins[4] = {pin_B13, pin_B12, pin_B15, pin_B14};
        pin_names = (mp_obj_t)default_pins;
        array_len = 4;
#endif
    } else {
        mp_obj_get_array(args[0], &array_len, &pin_names);
    }
    if (array_len != 4) {
        
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("Pin list requires 4 items, %d given"), array_len);
    }

    // Get array of pin objects: False / empty values are valid for pins[2:3],
    // empty values get set to MP_OBJ_NULL
    // pins[0:3] set from user-provided array; pins[4] is MCK which is fixed to be
    // C6 for I2S2 and C7 for I2S3:
    const pin_obj_t *pins[5];
    for (int i = 0; i < 4; i++) {
        if (mp_obj_is_true(pin_names[i])) {
            pins[i] = pin_find(pin_names[i]);
        } else {
            pins[i] = MP_OBJ_NULL;
        }

        // DEBUG - print list of pin objects. This information can also
        // be accessed from within uPy with the command pyb.Pin.debug(True)
        if (0) {
            mp_obj_print((mp_obj_t)pins[i], PRINT_STR);
            printf("\n");
        }
    }

    // Check if pins represents a valid I2S port configuration:
    // Each entry of pins[] array (0=BCK, 1=WS, 2=TX, 3=RX) is checked to
    // determine if it is valid for its designated function.
    // Of the two entries for data pins (2-TX and 3-RX) exactly one of them
    // must be a valid base SD pin for the same I2S port as BCK and WS

