rf-eng/micropython/ports/stm32/i2s.c
    const pin_af_obj_t *pin_af[5];
    mp_uint_t i2s_id = 0;
    bool base_is_tx = false;
    qstr pin_err = 0;

    // Check pins[BCK] (first entry in array) to determine which I2S instance
    // it belongs to. The pin will have an I2S af for at most one of the
    // available ports. Each I2S instance has one pin that can be used for MCK,
    // this gets added to the array here as the I2S instance is selected.
#if MICROPY_HW_ENABLE_I2S2
    pin_af[BCK] = pin_find_af(pins[BCK], AF_FN_I2S, 2);
    if (pin_af[BCK]->type == AF_PIN_TYPE_I2S_CK) {
        i2s_id = 2;
        pins[MCK] = pin_C6;
    }
#endif
#if MICROPY_HW_ENABLE_I2S3
    pin_af[BCK] = pin_find_af(pins[BCK], AF_FN_I2S, 3);
    if (pin_af[BCK]->type == AF_PIN_TYPE_I2S_CK) {
        i2s_id = 3;
        pins[MCK] = pin_C7;
    }
#endif

    if (i2s_id == 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("%q not an I2S BCK pin"), pins[BCK]->name);
    } else {
        for (int i = 0; i < NUM_PINS /* = 5 */; i++) {
            pin_af[i] = pin_find_af(pins[i], AF_FN_I2S, i2s_id);
        }
    }

    if (pin_af[WS]->type == AF_PIN_TYPE_I2S_WS) {
        // Clock and Word Select pins are valid
        if (pin_af[TX]->type == AF_PIN_TYPE_I2S_SD) {
            base_is_tx = true;
            if (pins[RX] != MP_OBJ_NULL) {
                pin_err = pins[RX]->name;
            }
        } else if (pin_af[RX]->type == AF_PIN_TYPE_I2S_SD) {
            base_is_tx = false;
            if (pins[TX] != MP_OBJ_NULL) {
                pin_err = pins[TX]->name;
            }
        } else {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid SD pin for I2S%d"), i2s_id);
        }
    } else {
        pin_err = pins[WS]->name;
    }

    if (pin_err) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("%q not valid for I2S%d"), pin_err, i2s_id);
    }


//  TODO see if there is a way to make the following mapping code a bit more elegant
#if (MICROPY_HW_ENABLE_I2S3) && !(MICROPY_HW_ENABLE_I2S2)
#define I2S_OBJECT_OFFSET (3)
#else
#define I2S_OBJECT_OFFSET (2)
#endif
    // get I2S object and set initialization flags
    pyb_i2s_obj_t *i2s_obj;
    if (MP_STATE_PORT(pyb_i2s_obj_all)[i2s_id - I2S_OBJECT_OFFSET] == NULL) {
        // create new I2S object
        // - the I2S object is allocated on the MicroPython heap
        // - I2S root pointer is mapped to this I2S object
        // - I2S root pointers are defined in mpconfigport.h
        i2s_obj = m_new_obj(pyb_i2s_obj_t);
        i2s_obj->base.type = &pyb_i2s_type;
        i2s_obj->i2s_id = i2s_id;
        i2s_obj->is_enabled = false;
        MP_STATE_PORT(pyb_i2s_obj_all)[i2s_id - I2S_OBJECT_OFFSET] = i2s_obj;
    } else {
        i2s_obj = MP_STATE_PORT(pyb_i2s_obj_all)[i2s_id - I2S_OBJECT_OFFSET];
    }

    i2s_obj->callback = mp_const_none;
    i2s_obj->base_is_tx = base_is_tx;
    for (int i = 0; i < NUM_PINS; i++) {
        i2s_obj->pins[i] = pins[i];
    }

    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        pyb_i2s_init_helper(i2s_obj, n_args - 1, args + 1, &kw_args);
    }

    return (mp_obj_t)i2s_obj;
}

STATIC mp_obj_t pyb_i2s_init(mp_uint_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    return pyb_i2s_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2s_init_obj, 1, pyb_i2s_init);

/// \method deinit()
/// Turn off the I2S bus.
STATIC mp_obj_t pyb_i2s_deinit(mp_obj_t self_in) {
    pyb_i2s_callback(self_in, mp_const_none);
    pyb_i2s_obj_t *self = self_in;
    if (self->is_enabled) {
        dma_deinit(self->tx_dma_descr);
        dma_deinit(self->rx_dma_descr);
        HAL_I2S_DeInit(&self->i2s);
        self->is_enabled = false;
    }
    if (0) {
#if MICROPY_HW_ENABLE_I2S2
    } else if (self->i2s.Instance == SPI2) {
        __SPI2_FORCE_RESET();
        __SPI2_RELEASE_RESET();
        __SPI2_CLK_DISABLE();
#endif
#if MICROPY_HW_ENABLE_I2S3
    } else if (self->i2s.Instance == SPI3) {
        __SPI3_FORCE_RESET();
        __SPI3_RELEASE_RESET();
        __SPI3_CLK_DISABLE();
#endif
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_i2s_deinit_obj, pyb_i2s_deinit);

// TODO - adapt docstrings copied from spi.c for i2s

/// \method send(send, *, timeout=100)
/// Send data on the bus:
///
///   - `send` is the data to send (an integer to send, or a buffer object).
///   - `timeout` is the timeout in milliseconds to wait for the send.
///
/// Return value: `None`.
STATIC mp_obj_t pyb_i2s_send(mp_uint_t n_args, const mp_obj_t *pos_args,
                             mp_map_t *kw_args) {
    // skeleton copied from spi.c
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_send,    MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 100} },
    };

    // parse args
    pyb_i2s_obj_t *self = pos_args[0];
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args,
                     MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (!self->base_is_tx) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S(%d) base instance not in transmit mode"), self->i2s_id);
    }

    if (self->xfer_state > BUF_STR_DIV) {
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("Buffer op not allowed while streaming"));
    }
    self->xfer_state |= BUFFER_WR;
    // get the buffer to send from
    mp_buffer_info_t bufinfo;
    uint8_t data[1];
    pyb_buf_get_for_send(args[0].u_obj, &bufinfo, data);
    
    // send the data
    HAL_StatusTypeDef status;
    status = i2s_bus_sync(self, 0 /*polarity*/, 100);
    if (status != HAL_OK) {
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("No I2S bus clock"));
    }
    // TODO - implement 24-bit and 32-bit data width cases for all methods
    if (query_irq() == IRQ_STATE_DISABLED) {
        status = HAL_I2S_Transmit(&self->i2s, bufinfo.buf, bufinfo.len / 2, args[1].u_int);
    } else {
        status = HAL_I2S_Transmit_DMA(&self->i2s, bufinfo.buf, bufinfo.len / 2);
        if (status == HAL_OK) {
            status = i2s_wait_dma_finished(&self->i2s, args[1].u_int);
        }
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2s_send_obj, 1, pyb_i2s_send);

// TODO - adapt docstrings copied from spi.c for i2s

