rf-eng/micropython/ports/stm32/i2s.c
/// \method recv(recv, *, timeout=100)
///
/// Receive data on the bus:
///
///   - `recv` can be an integer, which is the number of bytes to receive,
///     or a mutable buffer, which will be filled with received bytes.
///   - `timeout` is the timeout in milliseconds to wait for the receive.
///
/// Return value: if `recv` is an integer then a new buffer of the bytes received,
/// otherwise the same buffer that was passed in to `recv`.
///
/// TODO implement a flush to overcome the alignment issues for back-to-back reads
/// https://community.st.com/s/question/0D50X00009XkeU5SAJ/stm32f7-i2s-dma-data-shift-flushing-issue
STATIC mp_obj_t pyb_i2s_recv(mp_uint_t n_args, const mp_obj_t *pos_args,
                             mp_map_t *kw_args) {
    // TODO check transmission size for I2S

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_recv,    MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 100} },
    };

    // parse args
    pyb_i2s_obj_t *self = pos_args[0];
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args,
                     MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (self->base_is_tx) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S(%d) base instance not in receive mode"), self->i2s_id);
    }
    if (self->xfer_state > BUF_STR_DIV) {
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("Buffer op not allowed while streaming"));
    }
    self->xfer_state |= BUFFER_RD;
    // get the buffer to receive into
    vstr_t vstr;
    mp_obj_t o_ret = pyb_buf_get_for_recv(args[0].u_obj, &vstr);

    // receive the data
    HAL_StatusTypeDef status;
    status = i2s_bus_sync(self, 0 /*polarity*/, 100);
    if (status != HAL_OK) {
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("No I2S bus clock"));
    }
    // TODO - implement 24-bit and 32-bit data transfers for all methods
    if (query_irq() == IRQ_STATE_DISABLED) {
       status = HAL_I2S_Receive(&self->i2s, (uint16_t*)vstr.buf,
                                 vstr.len / 2, args[1].u_int);
    } else {
        status = HAL_I2S_Receive_DMA(&self->i2s, (uint16_t*)vstr.buf, vstr.len / 2);
        if (status == HAL_OK) {
            status = i2s_wait_dma_finished(&self->i2s, args[1].u_int);
        }
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }

    // return the received data
    if (o_ret != MP_OBJ_NULL) {
        return o_ret;
    } else {
        return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2s_recv_obj, 1, pyb_i2s_recv);

// TODO - adapt docstrings copied from spi.c for i2s

/**** I2S streaming methods: ****/
// Taken from stream.c; could use to make sure stream is opened in binary mode?
#define STREAM_CONTENT_TYPE(stream) (((stream)->is_text) ? &mp_type_str : &mp_type_bytes)

mp_obj_t mp_stream_op_supported(mp_obj_t self_in, uint32_t op) {
    struct _mp_obj_base_t *o = (struct _mp_obj_base_t *)self_in;
    
    if (o->type->protocol == NULL) {
        // CPython: io.UnsupportedOperation, OSError subclass
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("stream object required"));
    } else if (op == MP_STREAM_OP_READ && ((mp_stream_p_t *)o->type->protocol)->read == NULL) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("object with stream.read required"));
    } else if (op == MP_STREAM_OP_WRITE && ((mp_stream_p_t *)o->type->protocol)->write == NULL) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("object with stream.write required"));
    } else if (op == MP_STREAM_OP_READ && ((mp_stream_p_t *)o->type->protocol)->ioctl == NULL) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("object with stream.ioctl required"));
    }
    return o;
}

mp_obj_t mp_stream_read(mp_obj_t self_in, void *buf, mp_uint_t len) {
    // Supported op check included here for portability and to be equivalent to
    // mp_stream_write; some stream read methods will now have redundant checks:
    struct _mp_obj_base_t *o = mp_stream_op_supported(self_in, MP_STREAM_OP_READ);
    int error;
    mp_uint_t out_sz = ((mp_stream_p_t *)o->type->protocol)->read(self_in, buf, len, &error);
    if (out_sz == MP_STREAM_ERROR) {
        if (mp_is_nonblocking_error(error)) {
            return mp_const_none;
        }
        nlr_raise(mp_obj_new_exception_arg1(&mp_type_OSError, MP_OBJ_NEW_SMALL_INT(error)));
    } else {
        return MP_OBJ_NEW_SMALL_INT(out_sz);
    }
}

STATIC mp_obj_t pyb_i2s_stream_out(mp_uint_t n_args, const mp_obj_t *pos_args,
                                   mp_map_t *kw_args) {

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_stream_out, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 100} },
        { MP_QSTR_len, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        // TODO: Allow length to have units other than n_samples
    };

    // parse args
    pyb_i2s_obj_t *self = pos_args[0];
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args,
                     MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_obj_t stream = mp_stream_op_supported(args[0].u_obj, MP_STREAM_OP_READ);

    // make sure that I2S bus is configured for transmit:
    if (!i2s_has_tx(self)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S(%d) not configured for tx"), self->i2s_id);
    }

    // If I2S state is not 'ready', raise an error
    if (HAL_I2S_GetState(&self->i2s) != HAL_I2S_STATE_READY) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S(%d) bus busy"), self->i2s_id);
    } else {
        // set up for simplex stream_out
        self->xfer_signal = I2S_SIG_NONE;
        self->xfer_state = STREAM_OUT;
        self->stream_tx_len = args[2].u_int;
        int buf_sz = AUDIOBUFFER_BYTES / 4;
        self->dstream_tx = stream;
        self->pp_ptr = 0;

        // If stream length is specified:
        if ((self->stream_tx_len > -1) && (buf_sz / 4 > self->stream_tx_len)) {
            buf_sz = self->stream_tx_len * 4;
        }
        mp_obj_t ret = mp_stream_read(self->dstream_tx, &self->audiobuf_tx[self->pp_ptr], buf_sz);
        if (mp_obj_is_integer(ret)) {
            self->last_stream_read_sz = mp_obj_get_int(ret);
            // decrement length if it was specified
            if (self->stream_tx_len > -1) { 
                if (self->stream_tx_len >= self->last_stream_read_sz / 4) {
                    self->stream_tx_len -= self->last_stream_read_sz / 4;
                } else {
                    self->stream_tx_len = 0;
                }
            }
            if (self->last_stream_read_sz == 0) {
                self->xfer_signal = I2S_SIG_EOF_TX;
            }
        } else {
            // If ret isn't an integer it indicates a stream read error, stop tx:
            self->xfer_signal = I2S_SIG_EOF_TX;
        }

        // Sync to I2S bus and start sending data:
        HAL_StatusTypeDef status = i2s_bus_sync(self, 0 /*polarity*/, 100);
        if (status != HAL_OK) {
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("No I2S bus clock"));
        }
        i2s_stream_handler(self);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2s_stream_out_obj, 1, pyb_i2s_stream_out);

STATIC mp_obj_t pyb_i2s_stream_in(mp_uint_t n_args, const mp_obj_t *pos_args,
                                  mp_map_t *kw_args) {

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_stream_in, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 100} },
        { MP_QSTR_len, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        // TODO: Allow length to have units other than n_samples
    };

    // parse args
    pyb_i2s_obj_t *self = pos_args[0];
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args,
                     MP_ARRAY_SIZE(allowed_args), allowed_args, args);

