rf-eng/micropython/ports/stm32/i2s.c
    mp_obj_t stream = mp_stream_op_supported(args[0].u_obj, MP_STREAM_OP_WRITE);

    // make sure that I2S bus is configured for receive:
    if (!i2s_has_rx(self)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S(%d) not configured for rx"), self->i2s_id);
    }
    
    // If I2S state is not 'ready', raise an error
    if (HAL_I2S_GetState(&self->i2s) != HAL_I2S_STATE_READY) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S(%d) bus busy"), self->i2s_id);
    } else {
        // set up for simplex stream_in
        self->xfer_signal = I2S_SIG_NONE;
        self->xfer_state = STREAM_IN;
        self->stream_rx_len = args[2].u_int;
        int buf_sz = AUDIOBUFFER_BYTES / 4;
        self->dstream_rx = stream;
        self->pp_ptr = 0;

        // NOTE: stream_in is not the simple switching of rx/tx and read/write methods
        // from stream_out - the order of operations also must be reversed; the receive
        // must fill the buffer _before_ the buffer is written out a stream, and data
        // must be written out after the last receive. stream_in initiates the streaming
        // process by calling HAL_I2S_Receive_DMA and
        // any data received is written to dstream_rx by stream_handler when it is
        // invoked via HAL I2S callback

        // Sync to I2S bus and start receiving data:
        HAL_StatusTypeDef status = i2s_bus_sync(self, 0 /*polarity*/, 100);
        if (status != HAL_OK) {
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("No I2S bus clock"));
        }

        status = HAL_I2S_Receive_DMA(&self->i2s,
                                     self->audiobuf_rx[self->pp_ptr],
                                     buf_sz / 2);

        if (status != HAL_OK) {
            mp_hal_raise(status);
        }
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2s_stream_in_obj, 1, pyb_i2s_stream_in);

// TODO implement DMA circular-double-buffered mode.
// circular mode automatically links the buffers for uninterrupted streaming.  can also change linking of buffers on-the-fly:  this
// would allow for multiple buffers to be linked, similar to the esp32.  advantage is that other apps can have a longer
// worst case runtime before the I2S buffer needs to get written or read.
// suspect that there are gaps in the samples caused by the delay in restarting RxDMA after Rx interrupt.  Circular
// mode may fix that.
STATIC void i2s_stream_handler(pyb_i2s_obj_t *self) {
    // i2s_stream_handler manages HAL_I2S_*_DMA functions and data transfers
    // between streams and buffers:
    int buf_sz = AUDIOBUFFER_BYTES / 4;
    HAL_StatusTypeDef status = HAL_OK;

    // Set xfer_state as indicated by xfer_signal:
    int sig = self->xfer_signal;
    int state = self->xfer_state;
    if (sig == I2S_SIG_STOP_ALL || sig == I2S_SIG_EOF_ALL) {
        self->xfer_state = INACTIVE;
        self->xfer_signal = I2S_SIG_NONE;
    } else if (sig == I2S_SIG_STOP_RX || sig == I2S_SIG_EOF_RX) {
        if (state == STREAM_OUT) {
            self->xfer_state = STREAM_OUT;
        } else {
            self->xfer_state = INACTIVE;
        }
        self->xfer_signal = I2S_SIG_NONE;
    } else if (sig == I2S_SIG_STOP_TX || sig == I2S_SIG_EOF_TX) {
        if (state == STREAM_IN) {
            self->xfer_state = STREAM_IN;
        } else {
            self->xfer_state = INACTIVE;
        }
        self->xfer_signal = I2S_SIG_NONE;
    }
    // If sig == I2S_SIG_EOF_* then invoke user-defined callback
    if (sig > I2S_SIG_STOP_EOF_DIV) {
        i2s_handle_mp_callback(self);
    }

    // DMA transfer:
    if (self->xfer_state >= BUF_STR_DIV) {
        // xfer_state indicates active stream transfer
        self->pp_ptr = !(self->pp_ptr);
        if (self->xfer_state == STREAM_OUT) {
            status = HAL_I2S_Transmit_DMA(&self->i2s,
                                          self->audiobuf_tx[self->pp_ptr],
                                          self->last_stream_read_sz / 2);

        } else if (self->xfer_state == STREAM_IN) {
            // TODO - Simplex receive should not use last read or write size!
            status = HAL_I2S_Receive_DMA(&self->i2s,
                                         self->audiobuf_rx[self->pp_ptr],
                                         buf_sz / 2);
        } else {
            // TODO: clean up and raise an error?
            // shouldn't get here in normal operation
            status = HAL_ERROR;
        }
    } else {
        // If xfer_state indicates active buffer transfer (it shouldn't get here
        // in that case) or INACTIVE, all stream transfers are stopped.
        status = HAL_I2S_DMAStop(&self->i2s);
    }

    if (status != HAL_OK) {
        mp_hal_raise(status);
    }

    bool buf_ptr = !(self->pp_ptr);
    if ((self->xfer_state & STREAM_OUT) != 0) {
        if ((self->stream_tx_len > -1) && (buf_sz / 4 > self->stream_tx_len)) {
            buf_sz = self->stream_tx_len * 4;
        }
        mp_obj_t ret = mp_stream_read(self->dstream_tx, &self->audiobuf_tx[buf_ptr], buf_sz);
        if (mp_obj_is_integer(ret)) {
            self->last_stream_read_sz = mp_obj_get_int(ret);
            // decrement tx length if it was specified:
            if (self->stream_tx_len > -1) {
                if (self->stream_tx_len >= self->last_stream_read_sz / 4) {
                    self->stream_tx_len -= self->last_stream_read_sz / 4;
                } else {
                    self->stream_tx_len = 0;
                }
            }
            if (self->last_stream_read_sz == 0) {
                // A read of 0 length happens when at the end of the file stream or because
                // self->stream_tx_len == 0, either way set TX signal to EOF:
                self->xfer_signal = I2S_SIG_EOF_TX;
            }
        } else {
            // If ret isn't an integer it indicates a stream read error, stop tx:
            self->xfer_signal = I2S_SIG_EOF_TX;
        }
    }

    if ((self->xfer_state & STREAM_IN) != 0) {

