rf-eng/micropython/ports/stm32/i2s.c
        buf_sz = AUDIOBUFFER_BYTES / 4;
        if ((self->stream_rx_len > -1) && (buf_sz / 4 > self->stream_rx_len)) {
            buf_sz = self->stream_rx_len * 4;
        }
        // 32-bit dataformat:  I2S driver fills the buffer with 16-bit values.  Each 32-bit sample
        // is composed of two 16-bit values.  But the ordering of these 16-bit values is NOT little endian.
        // To correct this, every pair of 16-bit values needs to be swapped in the rx buffer.
        if (self->i2s.Init.DataFormat == I2S_DATAFORMAT_32B) {
            for (uint32_t s=0; s<AUDIOBUFFER_BYTES / 8; s+=2){
                uint16_t msw = self->audiobuf_rx[buf_ptr][s];
                uint16_t lsw = self->audiobuf_rx[buf_ptr][s+1];

                self->audiobuf_rx[buf_ptr][s] = lsw;
                self->audiobuf_rx[buf_ptr][s+1] = msw;
            }
        }
        mp_obj_t ret = mp_stream_write(self->dstream_rx, &self->audiobuf_rx[buf_ptr], buf_sz, MP_STREAM_RW_WRITE);
        if (mp_obj_is_integer(ret)) {
            self->last_stream_write_sz = mp_obj_get_int(ret);
            // decrement rx length if it was specified:
            if (self->stream_rx_len > -1) {
                if (self->stream_rx_len >= self->last_stream_write_sz / 4) {
                    self->stream_rx_len -= self->last_stream_write_sz / 4;
                } else {
                    self->stream_rx_len = 0;
                }
            }
            if (self->last_stream_write_sz == 0) {
                // A write of 0 length happens when the filesystem is full or when
                // self->stream_rx_len == 0, either way set RX signal to EOF:
                self->xfer_signal = I2S_SIG_EOF_RX;
            }
        } else {
            // If ret isn't an integer it indicates a stream write error, stop rx:
            self->xfer_signal = I2S_SIG_EOF_RX;
        }
    }
}

STATIC mp_obj_t pyb_i2s_pause(mp_obj_t self_in){
    pyb_i2s_obj_t *self = self_in;
    HAL_StatusTypeDef status;
    status = HAL_I2S_DMAPause(&self->i2s);
    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_i2s_pause_obj, pyb_i2s_pause);

STATIC mp_obj_t pyb_i2s_resume(mp_obj_t self_in){
    pyb_i2s_obj_t *self = self_in;
    HAL_StatusTypeDef status;
    status = HAL_I2S_DMAResume(&self->i2s);
    if (status != HAL_OK) {
        mp_hal_raise(status);
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_i2s_resume_obj, pyb_i2s_resume);

STATIC mp_obj_t pyb_i2s_stop(mp_uint_t n_args, const mp_obj_t *args){
    pyb_i2s_obj_t *self = args[0];
    if (n_args > 1) {
        const char *p = mp_obj_str_get_str(args[1]);
        qstr signal = qstr_from_str(p); 
        if (signal == MP_QSTR_stream_in) {
            self->xfer_signal |= I2S_SIG_STOP_RX;
        } else if (signal == MP_QSTR_stream_out) {
            self->xfer_signal |= I2S_SIG_STOP_TX;
        } else {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("%s not a valid stop argument"), p);
        }
    } else {
        self->xfer_signal = I2S_SIG_STOP_ALL;
    }
    //printf("stp %d,%d", self->xfer_signal, self->xfer_state);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(pyb_i2s_stop_obj, 1, 2, pyb_i2s_stop);

STATIC mp_obj_t pyb_i2s_callback(mp_obj_t self_in, mp_obj_t callback) {
    // Stub method to set a Python callback
    // TODO: determine whether interrupts need to be disabled; maybe not,
    // since I anticipate that I2S callbacks may be changed on the fly to
    // manage the behavior of long buffer transfers
    pyb_i2s_obj_t *self = self_in;
    if (callback == mp_const_none) {
        self->callback = mp_const_none;
    } else if (mp_obj_is_callable(callback)) {
        self->callback = callback;
    } else {
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("callback must be None or a callable object"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(pyb_i2s_callback_obj, pyb_i2s_callback);


STATIC const mp_map_elem_t pyb_i2s_locals_dict_table[] = {
    // instance methods
    { MP_OBJ_NEW_QSTR(MP_QSTR_init), (mp_obj_t)&pyb_i2s_init_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_deinit), (mp_obj_t)&pyb_i2s_deinit_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_send), (mp_obj_t)&pyb_i2s_send_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_recv), (mp_obj_t)&pyb_i2s_recv_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_stream_out), (mp_obj_t)&pyb_i2s_stream_out_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_stream_in), (mp_obj_t)&pyb_i2s_stream_in_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_pause), (mp_obj_t)&pyb_i2s_pause_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_resume), (mp_obj_t)&pyb_i2s_resume_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_stop), (mp_obj_t)&pyb_i2s_stop_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_callback), (mp_obj_t)&pyb_i2s_callback_obj },

    // class constants
    /// \constant MASTER - for initialising the bus to master mode
    /// \constant SLAVE - for initialising the bus to slave mode
    { MP_OBJ_NEW_QSTR(MP_QSTR_MASTER), MP_OBJ_NEW_SMALL_INT(0) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_SLAVE),  MP_OBJ_NEW_SMALL_INT(1) },

    // set format standard for I2S data
    { MP_OBJ_NEW_QSTR(MP_QSTR_PHILIPS),   MP_OBJ_NEW_SMALL_INT(I2S_STANDARD_PHILIPS) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_MSB),       MP_OBJ_NEW_SMALL_INT(I2S_STANDARD_MSB) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_LSB),       MP_OBJ_NEW_SMALL_INT(I2S_STANDARD_LSB) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_PCM_SHORT), MP_OBJ_NEW_SMALL_INT(I2S_STANDARD_PCM_SHORT) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_PCM_LONG),  MP_OBJ_NEW_SMALL_INT(I2S_STANDARD_PCM_LONG) },

    // set I2S clock source
    { MP_OBJ_NEW_QSTR(MP_QSTR_PLL),      MP_OBJ_NEW_SMALL_INT(I2S_CLOCK_PLL) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_EXTERNAL), MP_OBJ_NEW_SMALL_INT(I2S_CLOCK_EXTERNAL) },
};

STATIC MP_DEFINE_CONST_DICT(pyb_i2s_locals_dict, pyb_i2s_locals_dict_table);

const mp_obj_type_t pyb_i2s_type = {
    { &mp_type_type },
    .name = MP_QSTR_I2S,
    .print = pyb_i2s_print,
    .make_new = pyb_i2s_make_new,
    .locals_dict = (mp_obj_t)&pyb_i2s_locals_dict,
};

#endif // MICROPY_HW_ENABLE_I2S1 || MICROPY_HW_ENABLE_I2S2 || MICROPY_HW_ENABLE_I2S3
